using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp3
{
    class Program
    {
        static void Main(string[] args)
        {
        }

        /*1.	Игрок может передвигаться по прямоугольному полю размером Width на Height. 
2.	На поле располагаются бонусы (яблоко, вишня и т.д.), которые игрок может подобрать для поднятия каких-либо характеристик.
3.	За игроком охотятся монстры (волки, медведи, когти смерти и т.д.), которые могут передвигаться по карте по какому-либо алгоритму.
4.	На поле располагаются препятствия разных типов (камни, деревья и т.д.), которые игрок и монстры должны обходить.
Цель игры – собрать все бонусы и не быть «съеденным» монстрами.
*/
    }
}
